Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ཡི་གེ་དེ་དག་ནི་ཆོས་ཞེའམ། ཆོས་མ་ཡིན་ཞེས་བྱ་བར་རྣམ་པར་མི་རྟོག་གོ། །ཡི་གེ་དེ་དག་ནི་སུས་ཀྱང་བསྐྱེད་པའམ།
en: No one can produce these syllables, and no one can extinguish them.

source: བཀག་པ་མེད་དོ། །ཡི་གེ་དེ་དག་ནི་སུས་ཀྱང་བྱས་པའམ། ཆུད་གཟན་པ་མེད་དོ། །
en: No one can create the syllables, and no one can destroy them.

source: ཞི་བའི་བློ་གྲོས་ཡི་གེ་བགྲང་བ་ཇི་ལྟ་བར་སེམས་བགྲང་བ་ཡང་དེ་བཞིན་ནོ། །
en: “Just as there is a count of syllables, Śāntamati, in the same way there is a count of thoughts.

source: སེམས་བགྲང་བ་ཇི་ལྟ་བར་ཆོས་ཐམས་ཅད་བགྲང་བ་ཡང་དེ་བཞིན་ནོ། །
en: Just as there is a count of thoughts, in the same way there is a count of all things.

source: ཆོས་ཐམས་ཅད་བགྲང་བ་ཇི་ལྟ་བར་བགྲང་བ་མེད་པ་ཡང་དེ་བཞིན་ནོ། །
en: Just as there is a count of all things, in the same way there is no count.

source: ཆོས་ནི་བགྲང་བར་ཉེ་བར་འགྲོ་བ་མ་ཡིན་ཏེ་བགྲང་བ་མེད་པ་ནི་ཆོས་བགྲང་བའོ། །
en: It is because one does not reach a count of the Dharma. Therefore, there is no count that is the count of the Dharma.

source: ཇི་ལྟར་ཆོས་བགྲང་བར་ཉེ་བར་མི་འགྲོ་བ་བཞིན་དུ་ཨ་ཞེས་བྱ་བའི་རྗེས་སུ་འཇུག་པ་ཡང་དེ་ལྟ་བུ་སྟེ།
en: Just as the Dharma does not reach a count, in precisely the same way is the access to its aspects.

source: གཟོད་མ་ཉིད་ནས་མ་སྐྱེས་པ་ལ་འཇུག་པ། སྐྱེ་བ་མེད་པ་ལ་འཇུག་པའོ། །མ་སྐྱེས་པ་དང་མ་བྱུང་བ་གང་ཡིན་པ་དེ་ལ་འཇུག་པ་གང་ཡང་མེད་དོ། །
en: A point of entry that is not born from the very beginning is an entry into what does not arise, and there is no entry into what is not born and is not arisen.

source: དེ་ལྟར་ན་འཇུག་པ་མེད་པ་ནི་རྗེས་སུ་འཇུག་པའོ། །ཞི་བའི་བློ་གྲོས་སུ་བགྲང་བ་འདི་ལ་ཞུགས་པ་དེའི་སྤོབས་པ་རྒྱུན་གཅད་པར་མི་ནུས་སོ། །
en: For so it is that this entrance is not a point of entry, and, Śāntamati, it is not possible to interrupt the inspired eloquence of one who has entered into such a count.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྒྱུན་ཆད་པ་མེད་པས་དེས་ཆོས་ཉིད་རྗེས་སུ་རྟོགས་སོ། །
en: This is because a count that is uninterrupted has thereby reached the true nature of things;

source: དེས་ཆོས་ཉིད་མི་ཟད་པར་རྗེས་སུ་རྟོགས་སོ། །
en: a count that is not exhausted has thereby reached the true nature of things.

source: དེ་ཇི་ལྟ་ཇི་ལྟར་ཆོས་སྟོན་པ་དེ་ལྟ་དེ་ལྟར་ཆོས་དེ་དག་རྗོད་ཅིང་མངོན་དུ་འགྱུར་རོ། །
en: “Just as one teaches a thing, in exactly the same way those things are put into words and arise in the mind.

source: དེ་ཆོས་ཀྱི་རྣམ་པའི་རྗེས་སུ་འཇུག་པ་འདི་ལྟ་བུ་འདིས་སེམས་ཅན་གྱི་རྣམ་པ་ལ་འཇུག་གོ། །
en: With precisely the same method one uses to access the aspects of the Dharma, one accesses the aspects of beings.

source: སེམས་ཅན་གྱི་རྣམ་པའི་རྗེས་སུ་འཇུག་པས་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་ཏོ། །
en: By accessing the aspects of beings, one teaches the Dharma in accordance with beings’ level of dedication.

source: ཞི་བའི་བློ་གྲོས་གཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཀྱི་དྲི་མ་མེད་པ་ཡིན་ནོ། །
en: “Bodhisattvas who have acquired a powerful memory and the formulas that support it, Śāntamati, are stainless in thought.

source: བསམ་པས་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: They are pure in motivation.

source: སྦྱོར་བས་གཙང་མ་ཡིན་ནོ། །
en: They are transparent in practice.

source: ལྷག་པའི་བསམ་པས་མངོན་དུ་འཕགས་པ་ཡིན་ནོ། །
en: They are superior in ambition.

source: བསྒྲུབ་པ་ལ་ལེགས་པར་གནས་པ་ཡིན་ནོ། །
en: They are firmly established in good conduct.

source: ཤེས་རབ་ཀྱིས་མངོན་དུ་འཕགས་པ་ཡིན་ནོ། །
en: They are superior in wisdom.

source: དམ་བཅས་པ་ཉམས་འོག་ཏུ་ཆུད་པས་བརྟན་པ་ཡིན་ནོ། །
en: They are rock-solid in keeping their promises.

source: བདུད་རྣམས་ཀྱིས་མི་ཤིགས་པ་ཡིན་ནོ། །
en: They are not liable to be disturbed by the māras.

source: ཕ་རོལ་མུ་སྟེགས་བྱེད་རྣམས་ཀྱིས་མི་འདུས་པ་ཡིན་ནོ། །
en: They are unmatched by rival teachers.

source: ཉོན་མོངས་པ་རྣམས་ཀྱིས་མི་རྫི་བ་ཡིན་ནོ། །
en: They are not liable to be oppressed by the afflictions.

source: ཕ་རོལ་རྒོལ་བ་རྣམས་ཀྱིས་མི་ཐུབ་པ་ཡིན་ནོ། །
en: They are unassailable by adversaries.

source: ལུས་ཀྱིས་སྟོབས་དང་ལྡན་པ་ཡིན་ནོ། །
en: “They have strength in their bodies.

source: སེམས་ཀྱིས་ཞུམ་པ་མེད་པ་ཡིན་ནོ། །
en: Their minds are not depressed.

source: སྤོབས་པས་མི་ཟད་པ་ཡིན་ནོ། །
en: Their inspired eloquence is inexhaustible.

source: བསྟན་པ་རྣམས་ལ་མཐའ་ཡས་པ་ཡིན་ནོ། །
en: There is no end to their teachings.

source: ངེས་པའི་ཚིག་རྣམས་ལ་མུ་མེད་པ་ཡིན་ནོ། །
en: There is no limit to their explanations.

source: ཡེ་ཤེས་ཀྱིས་ཆགས་པ་མེད་པ་ཡིན་ནོ། །
en: They have no doubt about their knowledge.

source: བློས་གཏིང་དཔག་དཀའ་བ་ཡིན་ནོ། །
en: Their intellects are difficult to plumb.

source: བདེན་པ་བསྟན་པ་རྣམས་ལ་དོན་ཟབ་པ་ཡིན་ནོ། །
en: Their teachings of the truths are deep.

source: ཐོས་པས་རྒྱ་མཚོ་ལྟ་བུ་ཡིན་ནོ། །
en: What they have learned is comparable to the ocean.

source: ཏིང་ངེ་འཛིན་གྱིས་ལྷུན་པོ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as Mount Meru in concentration.

source: འཁོར་གྱི་ནང་ན་སེང་གེ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the lion among assemblies.

source: འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ལ་པད་མ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the lotus among things of the world.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བས་ས་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the earth in being a support for all beings.

source: ཉོན་མོངས་པ་དང་སྲེད་པ་འཁྲུ་བས་ཆུ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as water in removing the thirst of the afflictions.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་མེ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as fire in that they bring all beings to maturity.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པས་ཟླ་བ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the moon in that they are even-minded toward all beings.

source: ཉོན་མོངས་པའི་མུན་པ་སེལ་བས་ཉི་མ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the sun in that they disperse the darkness of the afflictions.

source: ཉོན་མོངས་པའི་དགྲ་འཇོམས་པས་དཔའ་བོ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: “They are the same as the valiant warrior in that they kill the enemy of the afflictions.

source: སེམས་ཤིན་ཏུ་དུལ་བས་གླང་པོ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the bull elephant in that their minds are well trained.

source: ཆོས་མངོན་དུ་སྒྲོགས་པས་འབྲུག་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the clouds in that they produce the thunder of the Dharma.

source: ཆོས་ཀྱི་ཆར་འབེབས་པས་ཆར་པ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as rain in showering the Dharma.

source: སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་ནད་ཞི་བར་བྱེད་པས་སྨན་པ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the doctor in that they alleviate the afflictions, which are the sickness of beings.

source: ཆོས་ཀྱི་རྒྱལ་སྲིད་བྱེད་པས་རྒྱལ་པོ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the king in that they create a kingdom of the Dharma.

source: འཇིག་རྟེན་གྱི་ཆོས་སྐྱོང་བས་འཇིག་རྟེན་སྐྱོང་བ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as the Lokapālas in protecting the Dharma for the world.

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྤྱན་དུ་གྱུར་པས་བརྒྱ་བྱིན་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as Śakra in that they are the overseer of gods and men.

source: དབང་ཐོབ་སྟེ་རང་གི་སེམས་ལ་དབང་སྒྱུར་བས་ཚངས་པ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as Brahmā in that they obtain offspring by having gained control over their own minds.

source: གནས་མེད་པར་རྒྱུ་བས་བྱ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: “They are like birds in that they wander without a home.

source: འདུ་འཛིས་འཇིགས་ཤིང་སྐྲག་པས་རི་དགས་དང་སྤྲེའུ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as forest-dwelling creatures like monkeys and deer in that they are filled with the fear of society.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེས་པར་བྱས་པ་ཐམས་ཅད་བཟོད་པས་མ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as a mother in that they mitigate all the bad actions of all beings.

source: བཟོ་ཐམས་ཅད་སློབ་པས་ཕ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as a father in that they offer training in all practical crafts and trades.

source: ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་སྦྱིན་པས་རྣམ་ཐོས་ཀྱི་བུ་དང་མཚུངས་པ་ཡིན་ནོ། །
en: They are the same as Vaiśravaṇa in that they distribute all the jewels of the Dharma.

source: བསོད་ནམས་དག་གིས་བརྒྱན་པ་ཡིན་ནོ། །
en: “They are adorned with merits.

source: མཚན་རྣམས་ཀྱིས་ཀླུབས་པ་ཡིན་ནོ། །དཔེ་བྱད་བཟང་པོ་རྣམས་ཀྱིས་སྤྲས་པ་ཡིན་ནོ། །
en: They are decorated with the distinctive features of a great being. They are beautified by the secondary marks.

source: འཇིག་རྟེན་གྱིས་བལྟ་བར་བྱ་བ་ཡིན་ནོ། །
en: They are worthy of the world’s regard.

source: ལྟ་བའི་གཞི་ཡིན་ནོ། །
en: They are worthy of holding the gaze.

source: འཕགས་པའི་ནོར་བདུན་དང་ལྡན་པས་མི་དབུལ་བ་ཡིན་ནོ། །
en: They are not destitute, being endowed with the seven riches.

source: སངས་རྒྱས་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ། །
en: They are remembered by the buddhas.

source: རིག་པ་རྣམས་ཀྱིས་བསྔགས་པ་ཡིན་ནོ། །
en: They are worthy of praise by those with practical knowledge.

source: མཁས་པ་ཐམས་ཅད་ཀྱིས་སྐུར་པ་མི་གདབ་པ་ཡིན་ནོ། །
en: They are irreproachable by all learned persons.

source: ལྷ་རྣམས་ཀྱིས་ལེགས་པར་བསྲུངས་པ་ཡིན་ནོ། །
en: They are well protected by the gods.

source: ཀླུ་དང་གནོད་སྦྱིན་རྣམས་ཀྱིས་ལེགས་པར་བཟུང་བ་ཡིན་ནོ། །
en: They are well received by nāgas and yakṣas.

source: ཆོས་བསྟན་པ་རྣམས་ལ་དབང་ཕྱུག་ཏུ་གྱུར་པ་ཡིན་ནོ། །
en: “They become sovereign lord over the teachings of the Dharma.

source: མངོན་པར་ཤེས་པ་རྣམས་ལ་དབང་སྒྱུར་བ་ཡིན་ནོ། །
en: They become master of the supernormal faculties.

source: སེམས་ཅན་གྱི་བསམ་པ་རྣམས་ལ་རྗེས་སུ་སོང་བ་ཡིན་ནོ། །
en: They have reached an understanding of beings’ motivations.

source: སེམས་ཅན་གྱི་དབང་པོ་རྣམས་ལ་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ། །
en: They have gained access to the spiritual faculties of beings.

source: ཆོས་བསྟན་པ་ལ་ཆོག་མི་ཤེས་པ་ཡིན་ནོ། །
en: They have an insatiable hunger for the teachings of the Dharma.

source: རྙེད་པ་དང་བཀུར་སྟི་དོན་དུ་མི་གཉེར་བ་ཡིན་ནོ། །
en: They take no interest in profit and recognition.

source: ཆོས་བསྟན་པ་དག་ལ་སེར་སྣ་མེད་པ་ཡིན་ནོ། །
en: They do not selfishly hoard the teachings of the Dharma.

source: ཚུལ་ཁྲིམས་རྣམ་པར་དག་པས་ཉོན་མོངས་པ་མེད་པ་ཡིན་ནོ། །
en: They do not take part in amusements, because of the purity of their moral conduct.

source: བཟོད་པ་ཡོངས་སུ་དག་པས་གནོད་པ་མེད་པ་ཡིན་ནོ། །
en: They do no violence, because of the purity of their patience.

source: བརྩོན་འགྲུས་ཡོངས་སུ་དག་པས་ལས་ཀྱི་མཐའ་ལེགས་པར་མཐར་ཕྱིན་པ་ཡིན་ནོ། །
en: They are highly accomplished in their professions, because of the purity of their heroic effort.

source: བསམ་གཏན་ཡོངས་སུ་དག་པས་ཅང་ཤེས་པ་ཡིན་ནོ། །
en: They are well bred, because of the purity of their meditation.

source: ཤེས་རབ་ཡོངས་སུ་དག་པས་བློ་ལེགས་པར་དཀར་བ་ཡིན་ནོ། །
en: Their intellects have stunning clarity, because of the purity of their wisdom.

source: ཚད་མེད་པ་རྣམས་ལ་ཚངས་པའི་བླ་མ་ཡིན་ནོ། །
en: They surpass Brahmā in regard to the immeasurable states.

source: བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ལ་འཇིག་རྟེན་ལས་འདས་པ་ཡིན་ནོ། །
en: They are transcendent in regard to the meditative states, concentrations, and absorptions.

source: བྱང་ཆུབ་ཀྱི་ལམ་གྱིས་བླ་ན་མེད་པ་ཡིན་ནོ། །
en: They are supreme among those on the path of awakening.

source: དབང་བསྐུར་བ་ཐོབ་པས་ཡོན་ཏན་གྱི་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པ་ཡིན་ནོ། །
en: They are endowed with virtue in all its aspects, because they have obtained the level of consecration.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཐོབ་པ་ནི་ཡོན་ཏན་གྱི་བསྔགས་པ་ཚད་མེད་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ཏེ།
en: “So it is, Śāntamati, that the description of the virtues of a bodhisattva who has acquired a powerful memory and the formulas that support it is immeasurable.

source: ཞི་བའི་བློ་གྲོས་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་ཕྲིན་ལས་གཞན་མི་མཛད་པར་ལོ་བརྒྱ་སྟོང་དུ་རྒྱུན་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཐོབ་པའི་བསྔགས་པ་བརྗོད་ཀྱང་ཟད་པར་མི་འགྱུར་རོ། །
en: Even if the Realized One were to set aside all other activities and give a description in praise of the virtues of a bodhisattva who has acquired a powerful memory and the formulas that support it, he would not arrive at the end of it, Śāntamati, even after hundreds of thousands of years.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་ལྷའི་བུ་རྒྱལ་པོ་བཟང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པས་ཁྱོད་ཀྱི་ཡོན་ཏན་གྱི་བསྔགས་པ་མཐའ་ཡས་པ་བརྗོད་པ་མཛད་པ་ནི་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: At that point, the bodhisattva Śāntamati said to the god Bhadrarāja, “The profit is well earned by you, friend, such that the Realized One gives this immeasurable praise of you.”

source: ལྷའི་བུ་རྒྱལ་པོ་བཟང་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་འདི་ལ་ཡང་དག་པ་དོན་དམ་པར་ན། གང་དེ་ལྟར་བསྔགས་པའི་ཆོས་གང་ཡང་མི་དམིགས་སོ། །
en: The god Bhadrarāja responded to the bodhisattva Śāntamati, “From the perspective of ultimate truth, noble son, there is no real thing here whatsoever that receives this praise.

source: རིགས་ཀྱི་བུ་གང་ལ་ཁ་དོག་མེད་པ་དང་། གཟུགས་མེད་པ་དང་། དབྱིབས་མེད་པ་དེའི་ཡོན་ཏན་གྱི་བསྔགས་པ་དང་། གཟུགས་ཀྱི་མཐའ་རྟོགས་པར་མི་ནུས་སོ། །
en: In fact, noble son, it is not possible to arrive at the end of the form of the virtues of something that has no color, form, or shape at all.

source: གང་ལ་གཟུགས་དང་། ཁ་དོག་དང་། དབྱིབས་འབའ་ཞིག་ཡོད་པ་དེའི་བསྔགས་པ་ནི་བརྗོད་པར་ནུས་སོ། །
en: Indeed, it is possible to praise the form of something only if it has form, color, and shape.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་བུ་རྒྱལ་པོ་བཟང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་མ་བསྡུས་པ།
en: The god Bhadrarāja then said to the Blessed One, “All things are not grasped, Blessed One;

source: ངའི་བ་མ་མཆིས་པ།
en: they are not ‘mine’;

source: ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པ། གང་གིས་ཀྱང་ཉེ་བར་སྤྲད་པར་བགྱི་བ་མ་ལགས་པ། གང་གིས་ཀྱང་བསལ་བ་མ་ལགས་པ་སྟེ།
en: they are not property, they are not offered by anyone, they are not snatched away by anyone.

source: འདི་ལ་བརྩོན་པ་དང་། ཡང་དག་པར་སྦྱོར་བར་བགྱིའོ། །བཅོམ་ལྡན་འདས་བརྩོན་པ་དང་། ཡང་དག་པར་སྦྱོར་བར་གྱུར་པ་རྣམས་ལ་ཆོས་དེ་དག་མངོན་དུ་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: Moreover, a constant effort should be made in this regard to do the correct practice, and then these things will appear before the minds of those who make a constant effort and do the correct practice.

source: དཔེར་བགྱི་ནས་ཆེན་པོ་འདི་ནི་ཆབ་ཀྱི་ཕུང་པོའི་སྟེང་ན་གནས་ཏེ། དེ་ལ་མི་གང་ཞིག་ཁྲོན་པ་འམ། ཁྲོན་པ་ཆེན་པོ་རྐོ་བ་དེ་ཆབ་དང་ལྡན་པར་འགྱུར་ཏེ། གང་མི་རྐོ་བ་དེས་ནི་མི་རྙེད་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པའི་ཡེ་ཤེས་དེ་ལ་སུ་ཞིག་བརྩོན་པར་བགྱིད་པ་དེ་ནི་ཡེ་ཤེས་འཐོབ་པར་འགྱུར་ཏེ། སུ་བརྩོན་པར་མི་བགྱིད་པ་དེས་ནི་ཡེ་ཤེས་འཐོབ་པར་མི་འགྱུར་ལགས་སོ། །
en: “Just as this great earth is situated upon a mass of water, Blessed One, so that if any person digs a well, even a small one, it fills with water, but if one doesn’t dig the well, then one won’t get any water, in precisely the same way, Blessed One, one who makes a constant effort for all-pervading knowledge reaches that knowledge, and one who does not make a constant effort assuredly does not reach that knowledge.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་པས་བྱང་ཆུབ་དོན་དུ་གཉེར་བ་རྣམས་ཀྱིས་རྟག་ཏུ་བརྩོན་པ་དང་། བརྩོན་འགྲུས་བརྩོམ་པར་བགྱིའོ། །དེ་ལྟར་ན་བརྩོན་པ་དེ་དག་ལ་ཆོས་དེ་དག་མངོན་དུ་འགྱུར་ལགས་སོ། །
en: It is for this reason then, Blessed One, that those who are intent upon awakening should make a constant, perpetual effort to cultivate this knowledge, and they should do so with heroic effort, and as a result these things will appear before their eyes.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་སྐྱེས་བུ་དམུས་ལོང་གིས་དེ་ལས་སྐྱེས་པའི་གཟུགས་རྣམས་མི་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཉོན་མོངས་པས་ལྡོངས་པའི་སེམས་ཅན་རྣམས་ཀྱང་དེ་ལས་སྐྱེས་པའི་ཆོས་རྣམས་མི་མཐོང་ལགས་སོ། །
en: “Just as someone who is blind from birth, Blessed One, does not see the forms there to be known, in the same way, beings who are blinded by the afflictions, Blessed One, do not see the things there to be known.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་སྐྱེས་བུ་མིག་དང་ལྡན་ཡང་སྣང་བ་མ་མཆིས་ན་མི་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་དག་ལྷའི་མིག་དང་ལྡན་དུ་ལགས་ཀྱང་དེ་དག་དགེ་བའི་བཤེས་གཉེན་གྱི་མན་ངག་མ་མཆིས་ན་མོས་པར་མི་འགྱུར། མཐོང་བར་མི་འགྱུར་ལགས་སོ། །
en: “Just as someone with the eyes to see does not see without a light, Blessed One, in the same way, others, even those who possess the divine eye, Blessed One, do not see or even take any interest without the instructions of a companion in the good.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་ལྷའི་མིག་ལ་ནི་སྣང་བས་བགྱི་བ་མ་མཆིས་པ་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཡོངས་སུ་སྦྱང་བ་བགྱིས་པ་ལ་ཡང་རྗེས་སུ་བསྟན་མི་འཚལ་ལོ། །
en: “Just as someone who possesses the divine eye has no need for light, Blessed One, in the same way, one who has done the preparatory work, Blessed One, has no need for more instructions.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་མངལ་ན་མཆིས་པའི་སེམས་ཅན་ནི་མི་གདའ་མི་མཐོང་ཡང་སྐྱེ་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པའི་བྱང་ཆུབ་ཀྱང་མི་མཐོང་མོད་ཀྱི། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱིས་ཀྱང་སྐྱེའོ། །
en: “Just as a being who has gone into the womb is not seen and does not see, Blessed One, but still develops, in the same way, a bodhisattva who has set out on the path with heroic effort does not see awakening at that time, Blessed One, but still develops the qualities of a buddha.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་རིའི་རྒྱལ་པོ་གངས་ཅན་ལ་ཤིང་ལྗོན་པ་གང་སྐྱེས་པ་དེ་ནི་བར་མ་དོར་ཆག་པའམ། སྐམ་པར་མི་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་འཕགས་པའི་ཆོས་ལ་སྦྱོར་བར་བརྩོན་པ་གང་གི་ཤེས་པ་སྐྱེས་པ་དེ་ཡང་མི་འཇིག་ཅིང་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གང་གི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བྱུང་བ་དེའི་ཚེ་རིན་པོ་ཆེ་སྣ་བདུན་འདི་ལྟ་སྟེ། འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་།
en: “Just as a tree that has grown on the snowy king of mountains does not splinter or wither before its time, Blessed One, in precisely the same way the knowledge that has grown in a noble one while engaged in the practice of the Dharma does not splinter or wane.

source: བདུན་པ་བློན་པོ་རིན་པོ་ཆེ་དག་འབྱུང་བར་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་གི་ཚེ་བྱང་ཆུབ་ཀྱི་སེམས་སྐྱེ་བ་དེའི་ཚེ་ཆོས་རིན་པོ་ཆེ་སྣ་བདུན་འདི་ལྟ་སྟེ། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཐབས་འབྱུང་བར་འགྱུར་ལགས་སོ། །
en: “Just as when a wheel-turning king arises to become sovereign lord of the four continents, Blessed One, then the seven jewels also arise for him, in the same way, when one conceives the aspiration for awakening, Blessed One, then the seven jewels of the Dharma arise—namely, generosity, moral conduct, patience, heroic effort, meditation, wisdom, and skill in means.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གང་གི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་རྒྱུ་བ་དེའི་ཚེ་སེམས་ཅན་རྣམས་ལ་དེའི་བྱམས་པ་ཐ་དད་པ་མ་མཆིས་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་བསྡུ་བའི་དངོས་པོ་བཞི་པོ་སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་སྤྱད་པ་དང་། དོན་འཐུན་པས་སེམས་ཅན་དག་སྡུད་པ་དེའི་ཚེ་སེམས་ཅན་རྣམས་ལ་དེ་ཐ་དད་པ་མ་མཆིས་ལགས་སོ། །
en: “Just as when the wheel-turning king travels throughout the four continents of the world, Blessed One, there is no variation in the love he has for beings, in the same way, when a bodhisattva draws beings with the four means of drawing others to oneself, Blessed One, the bodhisattva has no variation toward beings.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གང་གི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འདུན་ཁང་ན་མཆིས་པ་དེའི་ཚེ་འཐབ་པ་དང་རྩོད་པ་མ་མཆིས་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་འབེལ་བའི་གཏམ་གྱི་སླད་དུ་མཆིས་པ་དེའི་ཚེ་འཐབ་པ་དང་། རྩོད་པའི་གཏམ་མ་མཆིས་ལགས་སོ། །
en: “Just as when a wheel-turning king sits in council, Blessed One, there is no discord or dispute, in the same way, when a bodhisattva sits down to have a similar discussion of the Dharma, Blessed One, there is no discord or dispute in the discussion.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གང་གི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གནས་པར་འགྱུར་བ་དེའི་ཚེ་ཐོག་མར་རིའི་རྒྱལ་པོ་རི་རབ་དང་། རྒྱ་མཚོ་ཆེན་པོ་གནས་པར་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཐོག་མར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེའི་ཚེ་ལྷག་པའི་བསམ་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཐོག་མར་གནས་ལགས་སོ། །
en: “Just as when the cosmos of a billion worlds takes shape, Blessed One, then Mount Meru, the king of mountains, is the first thing to take shape, as well as the great ocean, in the same way, when a bodhisattva conceives the aspiration for awakening for the first time, Blessed One, then ambition and great compassion are the first things to take shape.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གང་གི་ཚེ་གདུགས་འཆར་བ་དེའི་ཚེ་རི་གང་དག་མཐོ་བ་དེ་དག་ལ་ཐོག་མར་འོད་ཟེར་འབབ་བོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཐོག་མར་བྱུང་བ་དེའི་ཚེ་སེམས་ཅན་གང་དག་དགེ་བའི་རྩ་བ་སྦྱངས་པ་དེ་དག་གིས་ཡེ་ཤེས་ཀྱི་སྣང་བ་དེ་མྱོང་བར་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་ས་བོན་ཐམས་ཅད་དང་།
en: “Just as when the sun rises, Blessed One, then rays of light fall first upon the tall mountains, in the same way, when the light of knowledge arises, Blessed One, then those beings who have put energy into developing the roots of virtue experience the light of knowledge.

source: རྩྭ་དང་། ཤིང་གེལ་བ་དང་། སྨན་དང་། ནགས་ཚལ་ཐམས་ཅད་ནི་སས་བཟེད་དེ་ཐམས་ཅད་ལས་བཅུད་མཉམ་དུ་གཏོང་ངོ་། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་བསམ་པའི་གཏོང་བས་སེམས་ཆགས་པ་མ་མཆིས་པར་གཏོང་ངོ་། །
en: “Just as the earth receives all the seeds of all the grasses, shrubs, plants, and trees of the forest, Blessed One, and the earth gives life to all of them equally, in the same way, the bodhisattva who has acquired a powerful memory and the formulas that support it, Blessed One, gives detached thought to all beings by giving them the motivation for the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་རྒྱལ་པོ་བཟང་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: The Blessed One then congratulated the god Bhadrarāja: “Excellent, divine one, excellent!

source: ལྷའི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དཔེ་དགོད་པ་བསྟན་པ་འདི་ལེགས་པར་སྨྲས་པ་ལེགས་སོ་ལེགས་སོ། །ལྷའི་བུ་རྩྭ་དང་།
en: By laying out this set of analogies, you have expressed this teaching well.

source: ནགས་ཚལ་ཇི་སྙེད་པ་དང་།
en: “Indeed, divine one, there are as many teachings that lay out analogies for the bodhisattva who has acquired a powerful memory and the formulas that support it as there are grasses and trees;

source: མིང་གི་བརྡ་དང་། ཆོས་ཀྱི་བརྡ་དང་། སྒྲའི་བརྡ་དག་ཇི་སྙེད་པ་དང་།
en: as many as there are names, words, and sounds, the meanings of which are established by convention;

source: གཟུགས་དང་། ཁ་དོག་གི་བརྡ་དག་ཇི་སྙེད་པ་དང་།
en: as many as there are forms and colors;

source: སེམས་ཅན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་ལ་འཇུག་པ་ཇི་སྙེད་པ་དང་།
en: as many as there are ways beings think and behave;

source: མིང་དང་གཟུགས་རབ་ཏུ་བརྗོད་པ་ཇི་སྙེད་པ་དང་།
en: as many as there are creations of name and form;

source: སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་པ་ཇི་སྙེད་པ་དང་།
en: as many as there are daily concerns of beings;

source: སེམས་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་སྤྱད་པ་ཟས་སྐོམ་ཇི་སྙེད་པར་ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་ཐོབ་པའི་དཔེ་དགོད་པ་བསྟན་པ་ཡང་དེ་སྙེད་དོ། །
en: and as many as there are foods and drinks that beings enjoy.

source: ལྷའི་བུ་དག་གཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གང་ཅི་ཡང་རུང་སྟེ། སངས་རྒྱས་ཀྱི་བཀའ་མ་ཡིན་པ་མེད་དོ། །
en: “Moreover, divine one, there is nothing said by a bodhisattva who has acquired a powerful memory and the formulas that support it that is not the word of the Buddha.

source: གཟུགས་སུ་སྣང་བ་འམ། སྒྲ་འམ། དྲི་འམ། རོ་འམ། རེག་བྱ་འམ། ཆོས་སུ་སྣང་བ་གང་ཅི་ཡང་རུང་སྟེ།
en: There is no manifestation of form, no manifestation of sound, smell, taste, tactile sensation, or mental object that such a bodhisattva does not manifest.

source: དེ་ལ་གང་སྣང་བར་མི་འགྱུར་བ་དེ་མེད་དོ། །དེ་ལ་གཞན་ལས་ཐོས་པ་ལ་རག་ལས་པའི་སྤོབས་པ་མེད་དོ། །
en: Such a bodhisattva’s inspired eloquence does not depend at all upon the hearsay of others.

source: གཞན་གྱི་ངོར་ལྟ་བ་ལ་རག་ལས་པའི་བསྟན་པ་མེད་དོ། །
en: The teaching of such a bodhisattva does not depend on someone else’s point of view.
